app/controllers/api/v1/recipes_controller.rb

  def index
    @recipes = Recipe.order(created_at: :desc)
---
SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."created_at" DESC

  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save!
---
INSERT INTO "recipes" ("title", "description", "rate", "prep_time", "servings", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["title", "Hello"], ["description", "How are you"], ["updated_at", "2023-09-18 17:13:05.426235"], ["id", 164]]